[
  {
    "date": "September 15, 2025",
    "text": "Hi. This will be my corner of the internet where I will share whatever I am currently enjoying, learning, or hating. That is my gift: not liking stuff. Over this next week or so, I plan to add a portfolio section with some of my architectural work to be better prepared for the career fair that occurs on 10/9/2025. Besides that, I don't know what else I'll add to this site in the next couple of days. No matter what arises, I plan on filling this site with stuff, whether it be jargon or my reflections on texts that I find enjoyable. Anyway, I am regurgitating what has already been stated, so I guess this is all for now."
  },
  {
    "date": "September 18, 2025",
    "text": "So far, I have been enjoying living in Minneapolis. Everything is nearby. The thing that I am currently working on is improving my ability to sit down and read. I need to design a space in my apartment that makes sitting down and reading attractive again. The issue is the lighting: I have a single north-facing window, and on top of that, I am on the first floor surrounded by tall buildings. So, note to self: fix this issue; the sweetness of the fruit outweighs the bitterness of lugging a desk up a flight of stairs. Also, I will upload some Catholic/Christian apologetic arguments to this site soon. I'll start with the Thomistic contingency argument."
  },
  {
    "date": "September 23, 2025",
    "text": "Today I woke up sick. I write this blog at 11:20 am and have already had three cups of coffee. I still feel sick and tired. I have all day to work on homework though—no school, no work, no duties today due to my sickness. Productivity, productivity, and more productivity. Just kidding; so far I have only watched a podcast that added zero substance to my life. The most I have done today is rebuild this site so it looks cleaner and more cohesive. Besides that, nothing of importance or growth. As for personal things to do, I have started uploading some of my architectural work and would like to add a few more projects. I thought of this conceptual urbanism idea: what if we tried to create a neighborhood block for a community of stylites? (See Simeon the Stylite for examples.) I think this would be fun for me to model as well as try to think of how people living on large columns would utilize space. It would force me to think of things like: How large is the distance between each person? How accessible should water and food be to the community until it becomes detrimental to their spiritual pursuits? Will there be a person delivering water and food, or could the residents have direct access to the resources? I am not sure if I will pursue this idea yet, but the idea arose when I read about St. Anthony of the Desert. Reading about this saintly human reminded me of St. Simeon. Just a thought... but if anyone gets inspired by this post, please do it. I am sure that you will make it better and more cohesive than I ever could. My will is what the Lord wills, and what the Lord wills is what is best for us. I put this idea out as a challenge to myself, a challenge to you the reader, and a challenge to the Overton Window of what is expected for the way humans use space. The spirit of America will be made anew in the coming years; our job is to start working toward it."
  },
  {
    "date": "September 29, 2025",
    "text": "I have made probably the boldest move I have made in quite a while. No coin, no treasure, no carnal desire (though this achievement is a carnal desire) could trump what I have just accomplished. I blocked the Safari app. I no longer have any access to the internet besides ChatGPT. Since I was 14, I have been obsessed with the idea of controlling how much media I consume. Though, like a man bound to substances, I sober up, fall back to addiction, and the ever-lasting wheel of the fallen human continues. Earlier this spring, I purchased a physical screen time gadget called Brick. This was the greatest leap I had made for controlling how much time I wasted. The downfall was my mindset. I lied to myself and told myself that I did need Safari, for 'just in case' situations. The longer that I kept Safari, the more I noticed I wasn't really using it for anything useful, nor did I ever have a 'just in case' situation arise during this time period. Well, yesterday, while in prayer, the Lord granted me the ability to see clearly that it was time for me to block and delete Safari. I am flesh. I am sure that over time a new challenge will arise, and I will need God's grace to help alleviate my self-inflicted sickness once again. Oh, and I will be working on a St. Thomas and Plato debate instead of the contingency argument."
  },
{
    "date": "October 9, 2025",
    "text": "Hello. I have finally put in a desk in my apartment. I have been 50x more productive, an added bonus is that I have blocked access to google and safari. I have spent a lot of my time working on Studio (and working). It's been oddly addicting to work on my floorplans (I have about 50 versions so far and I bet I'll have more later today); Though I will note that knowing when to stop or when to stop trying to tweak it, is crucial if one is under a time constraint. Last year, for my 2nd year, this was the case. I spent too much time reworking on my studio work that I actually started to fall behind in class. Having classmates that I can talk to, and see where they're at in the design process has really helped me know when to stop and move on to the next phase. Also, I need to remeber that it's still fine to rework older phases but I should start putting more time into whatever the newest phase is. Typically, I try to talk about my life when writing these blog posts, or talk about what I am currently into, but as of right now, all I do is work and studio. "
  }
]
